# Задача 7: Поиск подстроки. Напишите программу, которая находит все вхождения заданной подстроки в строке с использованием встроенных функций.

string = "Hello World"
substring = "l"
count = string.count(substring)
print("Количество вхождений подстроки '", substring, "' в строке '", string, "' : ", count)