# Задача 4: Поиск уникальных элементов в списке. Напишите программу, которая создает новый список, содержащий только уникальные элементы из исходного списка.

words = ['Три', 'Два', 'Один', 'Три']
print(set(words))